// დავალება 1: შექმენით ფუნქცია, რომელიც შეიძლება გამოყენებულ იქნეს როგორც ფუნქციის ჰოისტინგის მაგალითად. შექმენით ეს ფუნქცია მისი გამოძახების შემდეგ და აღწერეთ კომენტარებით თუ როგორ მუშაობს იგი ჰოისტინგის მეშვეობით.

let x = 10;
let y = 2;   //ამ შემთხვევაში თუ ჩვენ გამოვიძახებთ ცვალებს კოდი ჩვეულებრივ იმუშავებს, მაგრამ განვიხილოთ მეორე მაგალითი.

let a = 7;

document.getElementById("demo").innerHTML = `${a} ${b}`; 

let b = 3;

//მეორე მაგალითის შემთხვევაში კოდი არ გაეშვება,რადგან ცვალდი b გამოცხადდა მის გამოყენებამდე.